УТ_для_edt/src/Catalogs/смартПолезныеФайлы/смартПолезныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПолезныеФайлы</name>
  <comment>//++ #Б-6510 смарт: Фролов 17.04.2026 //Добавить в Рабочий стол сотрудника раздел &quot;Полезная информация&quot;</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартПолезныеФайлы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Добавить(Команда)
	
	ДобавитьФайл();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл()
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);

КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, АдресВременногоХранилища, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиФайлВОбъект(АдресВременногоХранилища, ВыбранноеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиФайлВОбъект(АдресВременногоХранилища, ПолныйПутьКФайлу)
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	
	ПозицияСлеша = СтрНайти(ПолныйПутьКФайлу, "\", НаправлениеПоиска.СКонца);
	
	Если ПозицияСлеша > 0 Тогда
		ИмяСРасширением = Сред(ПолныйПутьКФайлу, ПозицияСлеша + 1);
	Иначе
		ИмяСРасширением = ПолныйПутьКФайлу;
	КонецЕсли;
	
	ПозицияТочки = СтрНайти(ИмяСРасширением, ".", НаправлениеПоиска.СКонца);
	
	Если ПозицияТочки > 0 Тогда
		Расширение = НРег(Прав(ИмяСРасширением, СтрДлина(ИмяСРасширением) - ПозицияТочки));
		ИмяБезРасширения = Лев(ИмяСРасширением, ПозицияТочки - 1);
	Иначе
		Расширение = "";
		ИмяБезРасширения = ИмяСРасширением;
	КонецЕсли;
	
	Расширение = НРег(Расширение);

	ОбъектФормы.Наименование = ИмяБезРасширения;
	ОбъектФормы.Расширение = Расширение;
	ОбъектФормы.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(Расширение);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	ОбъектФормы.ФайлХранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	
	ОбъектФормы.Записать();
	
	ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");
	
	УдалитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Сообщить("Файл '" + ИмяБезРасширения + "' успешно загружен!");
	
КонецПроцедуры
